trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/АктОРасхожденияхПослеПеремещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="af172ffa-c1ad-407a-8f45-6f3200265096">
  <name>АктОРасхожденияхПослеПеремещения</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes extendedConfigurationObject="cb8fe983-3a0e-4691-8821-32135f680678">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ceef33fc-b037-4778-9a56-8d3c33a93e19">
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cbff09d2-d529-4720-93aa-be510323dfaa">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb1ddde6-eb79-482e-a410-70887847ccd8">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0722bc40-03c3-4ee3-a0f1-c8c6cca637f1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d922f5ac-9f0b-405a-82e3-7625cc3601c7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f0fe03a-a1b4-4897-a40c-3738f0ccaa56">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82a5f355-8fd0-4e9a-99f9-8c795e7f5dd1">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="784736c7-90b5-4b41-a6d7-39b8a2615247">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e2399d1-a2c2-4854-a4ca-7c055c972505">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="272e1fa8-9def-4676-9019-363b879755ce">
    <name>ДатаОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee497b1-1e0c-43d3-a7e9-08e21f7d0d40">
    <name>ОтработанБезРазбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="61efd39e-3811-4df9-b25b-3ed902d3cee8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e142c880-ca4a-404d-b1a4-0fe89b95bff1">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="317d4103-73cd-4b74-bad6-6ac08c5a26f0">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea2bc250-1bf2-447c-8afa-679066440e9d">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d286f92f-0066-4cbc-b43f-84d1a4d7fd09">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7af13f0e-7d2a-43bc-b50b-0433b43d6163">
      <name>ТекстовоеОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="113d2cdf-223f-4192-bf21-d0cacbd5aa72">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1ed03f5-f17a-4125-a3ee-5f56a2e5e6ec">
      <name>КомментарийПолучателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6ac9f5-56e0-4bf8-9bac-221813ee501a">
      <name>КоличествоУпаковокПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3c6c3875-f18a-420e-851b-89061eb15401">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ac39d370-cfc5-401b-ac2f-980d8c279870">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af318b4b-f6a5-4f8c-bfde-7be909b884ea">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="51890e5d-f996-4d59-bc4d-cb73a9a8b530">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5cd725a5-130d-4fb3-a73a-f36ecaaf186b">
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="822464c2-4343-473e-9cf7-aa599f3d0518">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="904a4b94-7fd0-447b-ad4b-7e1b00c166ad">
      <name>КомментарийМенеджера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5030b6ce-807d-4502-9efc-fd685b1ae3df">
      <name>СуммаРасхождений</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbaa155e-3e7c-4a5d-a9f7-f95c093cc07e">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыАктаОРасхождениях/СтатусыАктаОРасхождениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыАктаОРасхождениях</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Претензия</name>
  </enumValues>
  <enumValues>
    <name>Отработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/АктОРасхожденияхПослеПеремещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано И Не ЗначениеЗаполнено(ДатаОтработки) Тогда
		ДатаОтработки = ТекущаяДата();
	КонецЕсли; 
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Товары.Количество() > 0 Тогда
		
		РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(Товары[0].ДокументОснование, СкладОтправитель); 
		
	КонецЕсли; 	
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если Не Проведен И Товары.Количество() > 0 Тогда
		
		РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(Товары[0].ДокументОснование, СкладОтправитель); 
		
	КонецЕсли; 	
КонецПроцедуры


#КонецЕсли
